usps_print_rails_app/app/controllers/dummies_controller.rb

SELECT "dummies".* FROM "dummies"
---
  def index
    @dummies = Dummy.all

SELECT "dummies".* FROM "dummies" WHERE "dummies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @dummy = Dummy.find(params[:id])

SELECT "dummies".* FROM "dummies" WHERE "dummies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @dummy = Dummy.find(params[:id])

INSERT INTO "dummies" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 04 Nov 2012 05:10:24 UTC +00:00], ["first_name", nil], ["last_name", nil], ["updated_at", Sun, 04 Nov 2012 05:10:24 UTC +00:00]]
---
  def create
    @dummy = Dummy.new(params[:dummy])
    @dummy.first_name = params[:first_name]
    @dummy.last_name = params[:last_name]

    respond_to do |format|
      if @dummy.save

SELECT "dummies".* FROM "dummies" WHERE "dummies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "dummies" SET "first_name" = 'stuaert', "last_name" = '', "updated_at" = '2012-11-04 05:13:51.774728' WHERE "dummies"."id" = 1
---
  def update
    @dummy = Dummy.find(params[:id])

    respond_to do |format|
      if @dummy.update_attributes(params[:dummy])

SELECT "dummies".* FROM "dummies" WHERE "dummies"."id" = ? LIMIT 1  [["id", "11"]]
---
  def login
    @dummy = Dummy.find(23)